src/test/java/org/fsarmiento/invoicing/invoice/invoice-test-data.xml

<?xml version="1.0" encoding="UTF-8"?>
<dataset>		
	<address id="1" address1="1 Test Road" address2="" city="No Bug City" county="Success County" postcode="AB1 3CD" country=""/>
	<address id="2" address1="2 Another Road" address2="Along Test Address" city="Bright City" county="Bucks" postcode="CD21 4EF" country="United Kingdom"/>
	<address id="3" address1="7 Paris Road" address2="" city="Paris" county="" postcode="12345" country="France"/>

	<customer id="1" account="ACCOUNT1" name="test name1" onHold="false" billingAddressId="1" shippingAddressId="1"/>
	<customer id="2" account="ACCOUNT2" name="duplicated name" onHold="false" billingAddressId="2"/>
	<customer id="3" account="ACCOUNT3" name="duplicated name" onHold="true" billingAddressId="3"/>
	<customer id="4" account="ACCOUNTONHOLD" name="Mr Not Payer" onHold="true"/>	
	
	<invoice_header id="1" account="ACCOUNT1" invoiceDate="2011-05-20" status="1" notes="test note" comments="test comments"
		paymentTerms="30 days" paymentRef="TEST" totalExcVat="150" totalIncVat="180" totalVat="30" totalDiscount="0" currency="GBP"/>
		
	<invoice_line id="1" invoiceId="1" productCode="PRODUCT1" description="test product 1" unitOfMeasure="EACH" unitPrice="10" vatRate="20"
		quantity="9" totalExcVat="90" totalIncVat="108" vatValue="18" discountValue="0"/>
		
	<invoice_line id="2" invoiceId="1" productCode="PRODUCT2" description="test product 2" unitOfMeasure="EACH" unitPrice="15" vatRate="20"
		quantity="4" totalExcVat="60" totalIncVat="72" vatValue="12" discountValue="0"/>
	
	<invoice_header id="2" account="ACCOUNT1" invoiceDate="2011-06-20" status="0" notes="test note" comments="test comments"
		paymentTerms="30 days" paymentRef="TEST" totalExcVat="150" totalIncVat="180" totalVat="30" totalDiscount="0" currency="GBP"/>
		
	<invoice_line id="3" invoiceId="2" productCode="PRODUCT1" description="test product 1" unitOfMeasure="EACH" unitPrice="10" vatRate="20"
		quantity="9" totalExcVat="90" totalIncVat="108" vatValue="18" discountValue="0"/>
		
	<invoice_line id="4" invoiceId="2" productCode="PRODUCT2" description="test product 2" unitOfMeasure="EACH" unitPrice="15" vatRate="20"
		quantity="4" totalExcVat="60" totalIncVat="72" vatValue="12" discountValue="0"/>
		
	<invoice_header id="3" account="ACCOUNT2" invoiceDate="2011-05-20" status="0" notes="test note2" comments="test comments2"
		paymentTerms="IMMEDIATELY" paymentRef="TEST2" totalExcVat="150" totalIncVat="180" totalVat="30" totalDiscount="0" currency="GBP"/>
		
</dataset>